[
  {
    "project": "The backyard-wedding project",
    "logo": "/logos/weddingapp.svg",
    "background":"/images/backyard-4.jpg",
    "link": "https://angular-wedding-2.azurewebsites.net",
    "repo": "https://github.com/garengh4/angular-wedding-2/tree/main",
    "description": "With java 11 and the spring framework to store, manage, and protect our mysql database locally, my colleague Brandon Viera and I used angular 12 to implement features and showcase our knowledge as best we could in a professional environment. The idea is simple: homeowners put up postings of backyards they would like to rent out, and clients make reservations and secure transactions through the availability and location filter. This project follows object-oriented principles to understand security implications in the backend and frontend monolithic architecture because its all it needs right now."
  },
  {
    "project": "NodeJs api-interact",
    "link": "https://nodejs-thenodejsapp.azurewebsites.net/",
    "repo": "https://github.com/garengh4/nodejs-theNodeJsApp/tree/main",
    "description": "Having worked with nodejs professionally and personally, I think this framework allows for some really cool/easy multithreading with express.js as the backend. This template project here showcases how one would consume external json data and render it to the client while following RESTful principles. Having worked with aws and azure cloud containes, I think this is definitely the de-facto standard framework."
  },
  {
    "project": "Darksidte portfolio-app",
    "link":"www.google.com",
    "repo": "https://github.com/garengh4/svelte-darksidte/tree/main",
    "background": "/images/hd-2-b.jpg",
    "description": "Extensive chastising from a colleague I highly respect and a personal interest to understand html,css, and javascript/typescript has led me to create this beautiful frankenstein monster I call my portfolio app. Sveltekit and its Svelte UI componente framework has definitely allowed me to write breathtakingly concise components. It allowed me to do away with npms and focus on html, css, and javascript/typescript. While the creation of this template felt painful and slow because I felt like I was recreating the wheel in css, I am now very proud of this creation and ever more appreciative of the npms and documentations that currently exist in the web."
  }
]